app/Controllers/Obat.php

SELECT *
FROM `obat`
---
    public function index()
    {
        $obat_model = new ObatModel();
        $all_data_obat = $obat_model->findAll();