app/Models/ObatModel.php

    public function getKategoriObat()
    {
        return $this->db->table('kategori_obat')->get()->getResult();
---
SELECT *
FROM `kategori_obat`

    public function getJenisObat()
    {
        return $this->db->table('jenis_obat')->get()->getResult();
---
SELECT *
FROM `jenis_obat`

    public function getSatuanObat()
    {
        return $this->db->table('satuan_obat')->get()->getResult();
---
SELECT *
FROM `satuan_obat`

    public function getSuplier()
    {
        return $this->db->table('suplier')->get()->getResult();
---
SELECT *
FROM `suplier`